#!/usr/bin/env python
# coding: utf-8

# уравнение
# f(x) = 0.6x^3+5.5x^2+10x -5

# In[7]:


a = 0.6
b = 5.5
c = 10
d = (b**2)-(4*a*c)
print(d)
x1 = ((b*(-1))+(d**0.5))/(2*a)
x2 = ((b*(-1))-(d**0.5))/(2*a)
list = (x1,x2)

print(list)


# In[19]:


from sympy import *
from sympy.plotting import plot
x = Symbol('x')
y = 0.6*x**3+5.5*x**2+10*x -5  
print (solve(y,x))
plot(y)


# In[43]:


print(f'корни {x1} и {x2}')
print ('f(x)> 0 во множестве [-6.32174537314726: -3.25046383307744] и [0.405542539558034 : +(бесконечность)]')
print ('f(x)< 0 во множестве[-(бесконечность) : -6.32174537314726] и [-3.25046383307744 : 0.405542539558034]' )
print(f'вершины {x21} {x22}')
print(f'функция возрастает от -бесконечности до {x22} и от {x21} +бесконечности , а убывает на промежутке от {x22} до {x21}')


# In[39]:


from sympy import *

x = Symbol('x')
y = 0.6*x**3+5.5*x**2+10*x -5  
print(diff(0.6*x**3+5.5*x**2+10*x -5, x  ))
a1 = 1.8
b1 = 11
c1 = 10
d1 = (b1**2)-(4*a1*c1)
print(d1)
x21 = ((b1*(-1))+(d1**0.5))/(2*a1)
x22 = ((b1*(-1))-(d1**0.5))/(2*a1)
lшst = (x21,x22)

